Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
/*******************************************************
 * Smart Home ESP32 - TELEGRAM + THINGSBOARD Stage F Persistent Buffer
 * Board  : ESP32 DEVKIT
 * Input  : MQ2, DHT22, Magnet Sensor
 * Output : LED, Buzzer, Motor DC, LCD, Servo, Telegram Bot
 * Cloud  : ThingsBoard MQTT telemetry + event manager + server-side RPC
 * Storage: Persistent offline event buffer menggunakan ESP32 NVS
 *
 * Command Telegram:
 * /start, Help, Cek rumah, /status
 * Biru on/off, Merah on/off, Hijau on/off
 * Putih 1/2/3/off, Kipas 1/2/3/off, Bel
 * Pintu buka / Pintu tutup
 * Servo 0 ... Servo 180
 * Alarm off / /mute = matikan alarm kebakaran sementara
 * Alarm on / /unmute = aktifkan alarm kembali
 *******************************************************/
#include <Arduino.h>

#include <WiFi.h>
#include <LiquidCrystal_I2C.h>
#include <DHT.h>
#include <FastBot.h>
#include <ESP32Servo.h>
#include <PubSubClient.h>
#include <Preferences.h>
#include <stddef.h>
#include "secrets.h"

// ========== WIFI SETTING ==========
const char* ssid = WIFI_SSID;
const char* pass = WIFI_PASSWORD;

// ========== TELEGRAM SETTING ==========
#define BOT_TOKEN TELEGRAM_TOKEN
#define CHAT_ID   TELEGRAM_CHAT_ID

FastBot bot(BOT_TOKEN);

// ========== THINGSBOARD MQTT SETTING ==========
const char* TB_TELEMETRY_TOPIC = "v1/devices/me/telemetry";
const char* TB_RPC_REQUEST_TOPIC = "v1/devices/me/rpc/request/+";
const char* TB_RPC_RESPONSE_PREFIX = "v1/devices/me/rpc/response/";

WiFiClient tbWiFiClient;
PubSubClient tbMqttClient(tbWiFiClient);

bool rpcSubscribed = false;
bool immediateTelemetryRequested = false;

// =====================================================
// RPC SECURITY / TOKEN AUTHENTICATION
// =====================================================
uint8_t authFailedCount = 0;

const char* lastAuthStatus = "IDLE";
const char* lastAuthSource = "NONE";

// Temporary protection setelah authentication gagal berturut-turut
const uint8_t AUTH_MAX_FAILED_ATTEMPTS = 3;
const unsigned long SECURITY_LOCK_MS = 30000UL; // 30 detik untuk demo

bool securityLocked = false;
unsigned long securityLockStartedMillis = 0;

// ========== PIN HARDWARE ==========
#define DHTPIN       4
#define DHTTYPE      DHT22
#define Lampu_biru   14   // Lampu depan
#define Lampu_putih  27   // Lampu tidur/PWM
#define Lampu_merah  26   // Lampu belakang
#define Lampu_hijau  25   // Lampu tengah
#define Kipas_angin  33   // Fan/PWM
#define Bell         32   // Buzzer/bell kuning S orange G
#define MQ2_SENSOR   16   // Digital output MQ2, aktif LOW pada program ini
#define Magnet       17   // Sensor magnet pintu
#define SERVO_PIN    13   // Motor servo pintu

// ========== SERVO SETTING ==========
Servo myServo;

// false untuk servo standar SG90 0-180 derajat.
// Ubah menjadi true hanya jika menggunakan servo continuous rotation/360 derajat.
const bool SERVO_360_CONTINUOUS = false;

const int SERVO_CLOSED_ANGLE = 0;     // Posisi pintu tertutup
const int SERVO_OPEN_ANGLE   = 180;   // Posisi pintu terbuka

// Pengaturan untuk servo continuous rotation/360 derajat.
// 90 = berhenti, 180 = putar arah buka, 0 = putar arah tutup.
const int SERVO_360_STOP        = 90;
const int SERVO_360_OPEN_SPEED  = 180;
const int SERVO_360_CLOSE_SPEED = 0;

const unsigned long SERVO_360_MANUAL_RUN_MS = 2500UL;
const unsigned long FIRE_SERVO_RUN_MS       = 4000UL;

int servoCommand = SERVO_CLOSED_ANGLE;
bool servoDoorOpen = false;
bool fireServoDone = false;

bool servoTimedMoveActive = false;
bool servoTimedTargetDoorOpen = false;
unsigned long servoTimedMoveStartMillis = 0;
unsigned long servoTimedMoveDurationMs = 0;

// ========== FIRE ALARM SETTING ==========
const float FIRE_TEMP_THRESHOLD       = 30.0;  // MQ2 aktif + suhu >= nilai ini => kebakaran
const float FIRE_TEMP_CLEAR_THRESHOLD = 29.0;  // alarm pulih jika gas aman dan suhu <= nilai ini
const float FIRE_CRITICAL_TEMP        = 60.0;  // suhu >= nilai ini => kebakaran meski MQ2 belum aktif
const unsigned long FIRE_BLINK_MS     = 300;
const unsigned long FIRE_LCD_MS       = 1000;
const unsigned long FIRE_MUTE_MS      = 60000UL; // 1 menit, untuk uji coba
const int FIRE_FAN_PWM                 = 255;     // Kipas maksimum selama alarm aktif

// =====================================================
// ADAPTIVE INTELLIGENCE SETTING
// =====================================================
const int ADAPTIVE_WINDOW_SIZE = 10;
const int ADAPTIVE_MIN_SAMPLES = 5;
const float ADAPTIVE_WARNING_DELTA = 4.0;
const float ADAPTIVE_FIRE_DELTA    = 8.0;
const float ADAPTIVE_CLEAR_HYSTERESIS = 2.0;
// Dynamic fire threshold tidak boleh di bawah 30°C
const float ADAPTIVE_MIN_FIRE_THRESHOLD = 30.0;

// ========== OBJECT ==========
DHT dht(DHTPIN, DHTTYPE);
LiquidCrystal_I2C lcd(0x27, 16, 2);

// ========== SENSOR VALUE ==========
float humi = NAN;
float temp = NAN;
int MQ2_SENSOR_Value = HIGH;

// =====================================================
// ADAPTIVE INTELLIGENCE STATE
// =====================================================
float adaptiveTempHistory[ADAPTIVE_WINDOW_SIZE];
int adaptiveTempIndex           = 0;
int adaptiveTempCount           = 0;
float adaptiveBaselineTemp      = NAN;
float adaptiveWarningThreshold  = FIRE_TEMP_THRESHOLD - 2.0;
float adaptiveFireThreshold     = FIRE_TEMP_THRESHOLD;
float adaptiveClearThreshold    = FIRE_TEMP_CLEAR_THRESHOLD;
enum AdaptiveRiskStatus {RISK_SAFE, RISK_WARNING, RISK_DANGER};
AdaptiveRiskStatus adaptiveRiskStatus = RISK_SAFE;

// ========== STATUS FLAG ==========
bool fg = false;
bool fm = false;
bool fireActive = false;
bool fireNotifiedTelegram = false;
bool fireBlinkState = false;
bool fireMuted = false; // true = alarm fisik dibisukan sementara untuk uji coba

// Menyimpan kondisi koneksi agar status sensor dapat dikirim ulang
// ketika WiFi/Telegram tersambung kembali.
bool previousWiFiConnected = false;
bool initialOnlineSyncSent = false;
bool wifiStateInitialized = false;

// Status koneksi ThingsBoard khusus untuk event perubahan koneksi.
bool previousThingsBoardConnected = false;
bool thingsBoardStateInitialized = false;

// ========== OUTPUT STATE NORMAL ==========
int lampuBiruState  = LOW;
int lampuPutihPWM   = 0;
int lampuMerahState = LOW;
int lampuHijauState = LOW;
int kipasPWM        = 0;
int bellState       = LOW;

// ========== TIMER ==========
unsigned long lastDhtMillis = 0;
unsigned long lastLCDMillis = 0;
unsigned long lastFireBlinkMillis = 0;
unsigned long lastFireLcdMillis = 0;
unsigned long lastFireMuteMillis = 0;
unsigned long lastWiFiAttemptMillis = 0;
unsigned long lastSensorCheckMillis = 0;
unsigned long lastTelegramTickMillis = 0;
unsigned long lastFireTelegramTryMillis = 0;
unsigned long lastTelemetryMillis = 0;
unsigned long lastMqttRetryMillis = 0;
unsigned long lastRpcSubscribeMillis = 0;
int fireTelegramTryCount = 0;

const unsigned long FAST_SENSOR_CHECK_MS   = 100;
const unsigned long TELEGRAM_TICK_MS       = 1000;
const unsigned long TELEMETRY_INTERVAL_MS  = 15000UL;
const unsigned long MQTT_RETRY_MS          = 5000UL;
const unsigned long RPC_SUBSCRIBE_RETRY_MS = 5000UL;
const unsigned long FIRE_TELEGRAM_RETRY_MS = 5000UL;
const int FIRE_TELEGRAM_MAX_TRY = 3;

// Telegram bell pattern non-blocking
bool bellPatternActive = false;
bool bellPatternOn = false;
int bellBeepsLeft = 0;
unsigned long lastBellPatternMillis = 0;
const unsigned long BELL_ON_MS  = 250;
const unsigned long BELL_OFF_MS = 300;

// ========== EVENT MANAGER (RAM + PERSISTENT NVS BUFFER) ==========
const uint8_t EVENT_BUFFER_SIZE = 32;
const uint8_t MAX_EVENTS_PER_FLUSH = 3;

struct EventRecord {
  unsigned long sequence;
  char type[32];
  bool value;
  char source[20];
  unsigned long uptimeSeconds;
};

EventRecord eventBuffer[EVENT_BUFFER_SIZE];
uint8_t eventHead = 0;
uint8_t eventTail = 0;
uint8_t eventCount = 0;
unsigned long eventSequence = 0;
char lastEventType[32] = "NONE";

// ---------- Persistent storage untuk event offline ----------
// Preferences menggunakan NVS bawaan ESP32, sehingga tidak memerlukan library eksternal.
Preferences eventPreferences;

const char* EVENT_NVS_NAMESPACE = "eventbuf";
const char* EVENT_NVS_KEY       = "queue";
const uint32_t EVENT_STORAGE_MAGIC = 0x45565431UL; // "EVT1"
const uint16_t EVENT_STORAGE_VERSION = 1;

bool persistentStorageReady = false;
bool persistentStorageOk = false;
bool persistentBufferRestored = false;
uint8_t persistentStoredCount = 0;
unsigned long persistentSaveCount = 0;

struct PersistentEventSnapshot {
  uint32_t magic;
  uint16_t version;
  uint8_t count;
  uint8_t reserved;
  unsigned long eventSequence;
  char lastEventType[32];
  EventRecord events[EVENT_BUFFER_SIZE];
  uint32_t checksum;
};

