Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
// Satu buffer global menghindari alokasi snapshot sekitar 2 KB pada stack.
PersistentEventSnapshot persistentSnapshotBuffer;

// Cache sensor terpisah dari fg/fm agar event tidak terganggu oleh logika Telegram.
bool eventSensorStateInitialized = false;
bool previousGasForEvent = false;
bool previousDoorForEvent = false;

// =====================================================
// HELPER
// =====================================================
void lcdPrintLine(byte row, String text) {
  while (text.length() < 16) text += " ";
  lcd.setCursor(0, row);
  lcd.print(text.substring(0, 16));
}

String onOff(int value) {
  return value ? "ON" : "OFF";
}

int getEffectiveFanPWM() {
  return fireActive ? FIRE_FAN_PWM : kipasPWM;
}

bool getAlarmAudible() {
  // Status logis alarm; tidak mengikuti pulsa fisik 300 ms.
  return fireActive && !fireMuted;
}

bool getBuzzerActiveTelemetry() {
  // Status logis stabil untuk dashboard, bukan level pin pada setiap kedipan.
  return getAlarmAudible() || bellPatternActive || bellState == HIGH;
}

const char* getBuzzerMode() {
  if (fireActive) {
    return fireMuted ? "FIRE_MUTED" : "FIRE_BLINK";
  }

  if (bellPatternActive || bellState == HIGH) {
    return "MANUAL_BELL";
  }

  return "OFF";
}

bool getAlarmLampLogicalState(int normalState) {
  if (fireActive) {
    return !fireMuted;
  }
  return normalState == HIGH;
}

int getAlarmWhiteLampLogicalPWM() {
  if (fireActive) {
    return fireMuted ? 0 : 255;
  }
  return lampuPutihPWM;
}

bool telegramConfigured() {
  return String(BOT_TOKEN) != "ISI_TOKEN_BOT_TELEGRAM" &&
         String(CHAT_ID)   != "ISI_CHAT_ID_TELEGRAM" &&
         String(BOT_TOKEN).length() > 10 &&
         String(CHAT_ID).length() > 3;
}

bool thingsBoardConfigured() {
  return String(TB_HOST).length() > 0 &&
         String(TB_ACCESS_TOKEN).length() > 5 &&
         TB_PORT > 0;
}

bool sendTelegram(String message) {
  if (!telegramConfigured()) {
    Serial.println("Telegram belum dikonfigurasi. Cek BOT_TOKEN dan CHAT_ID.");
    return false;
  }

  if (WiFi.status() != WL_CONNECTED) {
    Serial.println("Telegram gagal dikirim: WiFi belum terhubung.");
    return false;
  }

  Serial.println("Kirim Telegram:");
  Serial.println(message);
  bot.sendMessage(message);
  return true;
}

bool isGasDetected() {
  MQ2_SENSOR_Value = digitalRead(MQ2_SENSOR);
  return (MQ2_SENSOR_Value == LOW);
}

bool isDoorOpen() {
  return (digitalRead(Magnet) == HIGH);
}

// =====================================================
// ADAPTIVE INTELLIGENCE
// =====================================================
bool adaptiveModelReady() {
  return adaptiveTempCount >= ADAPTIVE_MIN_SAMPLES;
}

const char* getAdaptiveRiskStatusText() {
  switch (adaptiveRiskStatus) {
    case RISK_WARNING:
      return "WARNING";
    case RISK_DANGER:
      return "DANGER";
    case RISK_SAFE:
    default:
      return "SAFE";
  }
}

void calculateAdaptiveThresholds() {
  if (adaptiveTempCount == 0) {
    return;
  }
  float total = 0.0;
  for (int i = 0; i < adaptiveTempCount; i++) {
    total += adaptiveTempHistory[i];
  }
  adaptiveBaselineTemp = total / adaptiveTempCount;
  adaptiveWarningThreshold = adaptiveBaselineTemp + ADAPTIVE_WARNING_DELTA;

  adaptiveFireThreshold = adaptiveBaselineTemp +ADAPTIVE_FIRE_DELTA;

  // Safety: jangan sampai dynamic threshold terlalu rendah.
  if (adaptiveFireThreshold < ADAPTIVE_MIN_FIRE_THRESHOLD) {
    adaptiveFireThreshold = ADAPTIVE_MIN_FIRE_THRESHOLD;
  }

  adaptiveClearThreshold = adaptiveFireThreshold - ADAPTIVE_CLEAR_HYSTERESIS;
}

void addAdaptiveTemperatureSample(float newTemperature) {
  if (isnan(newTemperature)) {
    return;
  }
  // Jangan belajar ketika kondisi kebakaran aktif
  if (fireActive) {
    return;
  }
  // Jangan belajar ketika gas/asap terdeteksi
  if (isGasDetected()) {
    return;
  }
  // Setelah model siap, jangan masukkan
  // temperatur abnormal ke baseline.
  if (adaptiveModelReady() && newTemperature >= adaptiveWarningThreshold) {
    return;
  }

  adaptiveTempHistory[adaptiveTempIndex] = newTemperature;
  adaptiveTempIndex++;

  if (adaptiveTempIndex >= ADAPTIVE_WINDOW_SIZE) {
    adaptiveTempIndex = 0;
  }

  if (adaptiveTempCount < ADAPTIVE_WINDOW_SIZE) {
    adaptiveTempCount++;
  }

  calculateAdaptiveThresholds();

  Serial.print("[ADAPTIVE] Samples=");
  Serial.print(adaptiveTempCount);

  Serial.print(" Baseline=");
  Serial.print(adaptiveBaselineTemp, 1);

  Serial.print(" Warning=");
  Serial.print(adaptiveWarningThreshold, 1);

  Serial.print(" Fire=");
  Serial.print(adaptiveFireThreshold, 1);

  Serial.print(" Clear=");
  Serial.println(adaptiveClearThreshold, 1);
}

// Ringkasan status untuk pesan Telegram.
String getSensorIndicatorText() {
  String s = "Status indikator sensor:\n";
  s += "Gas/asap: ";
  s += isGasDetected() ? "AKTIF / TERDETEKSI" : "AMAN";
  s += "\nPintu magnet: ";
  s += isDoorOpen() ? "AKTIF / TERBUKA" : "TERTUTUP";
  s += "\nKebakaran: ";
  s += fireActive ? "AKTIF" : "NORMAL";
  return s;
}

// =====================================================
// EVENT MANAGER
// =====================================================
void copyEventText(char* destination, size_t destinationSize, const char* source) {
  if (destinationSize == 0) return;
  strncpy(destination, source, destinationSize - 1);
  destination[destinationSize - 1] = '\0';
}

uint32_t calculatePersistentSnapshotChecksum(
  const PersistentEventSnapshot& snapshot
) {
  const uint8_t* data = reinterpret_cast<const uint8_t*>(&snapshot);
  const size_t dataLength = offsetof(PersistentEventSnapshot, checksum);

  // FNV-1a 32-bit: ringan dan cukup untuk mendeteksi snapshot NVS yang rusak.
  uint32_t hash = 2166136261UL;
  for (size_t i = 0; i < dataLength; i++) {
    hash ^= data[i];
    hash *= 16777619UL;
  }
  return hash;
}

void resetEventQueueInRam() {
  memset(eventBuffer, 0, sizeof(eventBuffer));
  eventHead = 0;
  eventTail = 0;
  eventCount = 0;
  eventSequence = 0;
  copyEventText(lastEventType, sizeof(lastEventType), "NONE");
}

bool saveEventQueueToNvs() {
  if (!persistentStorageReady) {
    persistentStorageOk = false;
    return false;
  }

  PersistentEventSnapshot& snapshot = persistentSnapshotBuffer;
  memset(&snapshot, 0, sizeof(snapshot));
  snapshot.magic = EVENT_STORAGE_MAGIC;
  snapshot.version = EVENT_STORAGE_VERSION;
  snapshot.count = eventCount;
  snapshot.eventSequence = eventSequence;
  copyEventText(
    snapshot.lastEventType,
    sizeof(snapshot.lastEventType),
    lastEventType
  );

  // Simpan event dalam urutan FIFO yang linear agar mudah dipulihkan.
  for (uint8_t i = 0; i < eventCount; i++) {
    uint8_t sourceIndex = (eventHead + i) % EVENT_BUFFER_SIZE;
    snapshot.events[i] = eventBuffer[sourceIndex];
  }

  snapshot.checksum = calculatePersistentSnapshotChecksum(snapshot);

  size_t written = eventPreferences.putBytes(
    EVENT_NVS_KEY,
    &snapshot,
    sizeof(snapshot)
  );

