Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
  bool success = (written == sizeof(snapshot));
  persistentStorageOk = success;

  if (success) {
    persistentStoredCount = eventCount;
    persistentSaveCount++;
    Serial.print("Persistent event buffer disimpan ke NVS. count=");
    Serial.println(persistentStoredCount);
  } else {
    Serial.print("GAGAL menyimpan persistent event buffer. bytes=");
    Serial.print(written);
    Serial.print("/");
    Serial.println(sizeof(snapshot));
  }

  return success;
}

bool restoreEventQueueFromNvs() {
  if (!persistentStorageReady) {
    persistentStorageOk = false;
    return false;
  }

  size_t storedLength = eventPreferences.getBytesLength(EVENT_NVS_KEY);

  if (storedLength == 0) {
    persistentStorageOk = true;
    persistentBufferRestored = false;
    persistentStoredCount = 0;
    Serial.println("Persistent event buffer: belum ada data tersimpan.");
    return true;
  }

  if (storedLength != sizeof(PersistentEventSnapshot)) {
    Serial.print("Persistent event buffer tidak kompatibel. bytes=");
    Serial.print(storedLength);
    Serial.print(", expected=");
    Serial.println(sizeof(PersistentEventSnapshot));
    eventPreferences.clear();
    resetEventQueueInRam();
    persistentStorageOk = false;
    persistentStoredCount = 0;
    return false;
  }

  PersistentEventSnapshot& snapshot = persistentSnapshotBuffer;
  memset(&snapshot, 0, sizeof(snapshot));
  size_t readLength = eventPreferences.getBytes(
    EVENT_NVS_KEY,
    &snapshot,
    sizeof(snapshot)
  );

  uint32_t expectedChecksum = calculatePersistentSnapshotChecksum(snapshot);
  bool valid =
    readLength == sizeof(snapshot) &&
    snapshot.magic == EVENT_STORAGE_MAGIC &&
    snapshot.version == EVENT_STORAGE_VERSION &&
    snapshot.count <= EVENT_BUFFER_SIZE &&
    snapshot.checksum == expectedChecksum;

  if (!valid) {
    Serial.println("Persistent event buffer rusak/tidak valid dan akan direset.");
    eventPreferences.clear();
    resetEventQueueInRam();
    persistentStorageOk = false;
    persistentStoredCount = 0;
    return false;
  }

  resetEventQueueInRam();

  eventCount = snapshot.count;
  eventHead = 0;
  eventTail = eventCount % EVENT_BUFFER_SIZE;
  eventSequence = snapshot.eventSequence;
  copyEventText(lastEventType, sizeof(lastEventType), snapshot.lastEventType);

  for (uint8_t i = 0; i < eventCount; i++) {
    eventBuffer[i] = snapshot.events[i];

    // Pastikan sequence berikutnya selalu lebih besar daripada event yang dipulihkan.
    if (eventBuffer[i].sequence > eventSequence) {
      eventSequence = eventBuffer[i].sequence;
    }
  }

  persistentStoredCount = eventCount;
  persistentBufferRestored = eventCount > 0;
  persistentStorageOk = true;

  Serial.print("Persistent event buffer dipulihkan dari NVS. count=");
  Serial.print(eventCount);
  Serial.print(", sequence terakhir=");
  Serial.println(eventSequence);

  return true;
}

void initializePersistentEventStorage() {
  persistentStorageReady = eventPreferences.begin(
    EVENT_NVS_NAMESPACE,
    false
  );

  if (!persistentStorageReady) {
    persistentStorageOk = false;
    Serial.println("GAGAL membuka NVS untuk persistent event buffer.");
    return;
  }

  persistentStorageOk = true;
  restoreEventQueueFromNvs();
}

bool eventQueueMustBePersistedNow() {
  // Event hanya wajib ditulis ke flash ketika koneksi cloud tidak tersedia,
  // atau ketika masih ada backlog yang sebelumnya sudah disimpan.
  // Ini menghindari penulisan NVS berulang saat knob/RPC digunakan ketika online.
  return WiFi.status() != WL_CONNECTED ||
         !tbMqttClient.connected() ||
         persistentStoredCount > 0;
}

void enqueueEvent(const char* type, bool value, const char* source) {
  eventSequence++;
  copyEventText(lastEventType, sizeof(lastEventType), type);

  // Jika penuh, buang event tertua agar event terbaru tetap tercatat.
  if (eventCount >= EVENT_BUFFER_SIZE) {
    Serial.print("Event buffer penuh. Event tertua dibuang: ");
    Serial.println(eventBuffer[eventHead].type);
    eventHead = (eventHead + 1) % EVENT_BUFFER_SIZE;
    eventCount--;
  }

  EventRecord& event = eventBuffer[eventTail];
  event.sequence = eventSequence;
  copyEventText(event.type, sizeof(event.type), type);
  event.value = value;
  copyEventText(event.source, sizeof(event.source), source);
  event.uptimeSeconds = millis() / 1000UL;

  eventTail = (eventTail + 1) % EVENT_BUFFER_SIZE;
  eventCount++;

  Serial.print("EVENT #");
  Serial.print(event.sequence);
  Serial.print(" ");
  Serial.print(event.type);
  Serial.print(" value=");
  Serial.print(event.value ? "true" : "false");
  Serial.print(" source=");
  Serial.print(event.source);
  Serial.print(" buffer=");
  Serial.println(eventCount);

  // Saat offline, simpan antrean seketika agar tetap ada jika listrik mati/reset.
  // Saat online tanpa backlog, event cukup berada di RAM lalu segera dipublish.
  if (eventQueueMustBePersistedNow()) {
    saveEventQueueToNvs();
  }
}

bool publishEventRecord(const EventRecord& event) {
  if (!tbMqttClient.connected()) return false;

  String payload;
  payload.reserve(360);
  payload += "{\"event_type\":\"";
  payload += event.type;
  payload += "\",\"event_sequence\":";
  payload += String(event.sequence);
  payload += ",\"event_value\":";
  payload += event.value ? "true" : "false";
  payload += ",\"event_source\":\"";
  payload += event.source;
  payload += "\",\"event_uptime_seconds\":";
  payload += String(event.uptimeSeconds);
  payload += ",\"last_event\":\"";
  payload += event.type;
  payload += "\",\"buffer_count\":";
  payload += String(eventCount > 0 ? eventCount - 1 : 0);
  payload += "}";

  bool published = tbMqttClient.publish(
    TB_TELEMETRY_TOPIC,
    payload.c_str()
  );

  Serial.print("Publish event ");
  Serial.print(event.type);
  Serial.print(": ");
  Serial.println(published ? "BERHASIL" : "GAGAL");

  if (published) {
    Serial.println(payload);
  }

  return published;
}

void flushEventQueue() {
  if (!tbMqttClient.connected() || eventCount == 0) return;

  uint8_t sentThisLoop = 0;
  bool queueChanged = false;
  bool publishFailed = false;

  while (eventCount > 0 &&
         sentThisLoop < MAX_EVENTS_PER_FLUSH &&
         tbMqttClient.connected()) {
    EventRecord& event = eventBuffer[eventHead];

