Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
    if (!publishEventRecord(event)) {
      publishFailed = true;
      break;
    }

    eventHead = (eventHead + 1) % EVENT_BUFFER_SIZE;
    eventCount--;
    sentThisLoop++;
    queueChanged = true;

    // Menjaga sesi MQTT tetap hidup tanpa membuat proses blocking panjang.
    tbMqttClient.loop();
  }

  bool connectionLostWithPendingEvents =
    eventCount > 0 && !tbMqttClient.connected();

  // Jika antrean berasal dari NVS, perbarui snapshot setelah satu batch berhasil.
  // Jika publish gagal/koneksi terputus, simpan sisa antrean agar tidak hilang.
  if ((queueChanged && persistentStoredCount > 0) ||
      publishFailed ||
      connectionLostWithPendingEvents) {
    saveEventQueueToNvs();
  }
}

void checkSensorEvents() {
  bool gasNow = isGasDetected();
  bool doorNow = isDoorOpen();

  if (!eventSensorStateInitialized) {
    previousGasForEvent = gasNow;
    previousDoorForEvent = doorNow;
    eventSensorStateInitialized = true;
    return;
  }

  if (gasNow != previousGasForEvent) {
    enqueueEvent(
      gasNow ? "GAS_DETECTED" : "GAS_CLEARED",
      gasNow,
      "SENSOR"
    );
    previousGasForEvent = gasNow;
  }

  if (doorNow != previousDoorForEvent) {
    enqueueEvent(
      doorNow ? "DOOR_OPENED" : "DOOR_CLOSED",
      doorNow,
      "SENSOR"
    );
    previousDoorForEvent = doorNow;
  }
}

void syncThingsBoardConnectionEvents() {
  bool nowConnected = tbMqttClient.connected();

  // Koneksi pertama setelah boot tidak disebut reconnect.
  if (!thingsBoardStateInitialized) {
    if (nowConnected) {
      thingsBoardStateInitialized = true;
      previousThingsBoardConnected = true;
    }
    return;
  }

  if (nowConnected != previousThingsBoardConnected) {
    enqueueEvent(
      nowConnected ? "THINGSBOARD_RECONNECTED" : "THINGSBOARD_DISCONNECTED",
      nowConnected,
      "SYSTEM"
    );
    previousThingsBoardConnected = nowConnected;
  }
}

// =====================================================
// SERVO CONTROL
// =====================================================
void writeServoRaw(int value) {
  servoCommand = constrain(value, 0, 180);
  myServo.write(servoCommand);
}

void setServoAngle(int angle) {
  servoTimedMoveActive = false;
  writeServoRaw(angle);

  int middleAngle = (SERVO_CLOSED_ANGLE + SERVO_OPEN_ANGLE) / 2;
  if (SERVO_OPEN_ANGLE >= SERVO_CLOSED_ANGLE) {
    servoDoorOpen = (servoCommand >= middleAngle);
  } else {
    servoDoorOpen = (servoCommand <= middleAngle);
  }
}

void startServoTimedMove(
  int command,
  unsigned long durationMs,
  bool targetDoorOpen
) {
  servoTimedMoveActive = true;
  servoTimedTargetDoorOpen = targetDoorOpen;
  servoTimedMoveStartMillis = millis();
  servoTimedMoveDurationMs = durationMs;
  writeServoRaw(command);
}

void updateServoTimedMove() {
  if (!servoTimedMoveActive) return;

  if (millis() - servoTimedMoveStartMillis >= servoTimedMoveDurationMs) {
    servoTimedMoveActive = false;

    if (SERVO_360_CONTINUOUS) {
      writeServoRaw(SERVO_360_STOP);
    }

    servoDoorOpen = servoTimedTargetDoorOpen;
  }
}

bool setDoorServo(bool open) {
  // Selama kebakaran, pintu tidak boleh ditutup dari Telegram maupun ThingsBoard.
  if (fireActive && !open) {
    servoDoorOpen = true;
    Serial.println("Pintu tidak ditutup karena status kebakaran masih aktif.");
    return false;
  }

  if (SERVO_360_CONTINUOUS) {
    int command = open ? SERVO_360_OPEN_SPEED : SERVO_360_CLOSE_SPEED;
    startServoTimedMove(
      command,
      SERVO_360_MANUAL_RUN_MS,
      open
    );
  } else {
    int targetAngle = open ? SERVO_OPEN_ANGLE : SERVO_CLOSED_ANGLE;
    setServoAngle(targetAngle);
    servoDoorOpen = open;
  }

  return true;
}

void triggerFireServoOpen() {
  if (fireServoDone) return;

  fireServoDone = true;
  Serial.println("==> Servo membuka pintu karena kebakaran");

  if (SERVO_360_CONTINUOUS) {
    startServoTimedMove(
      SERVO_360_OPEN_SPEED,
      FIRE_SERVO_RUN_MS,
      true
    );
  } else {
    setDoorServo(true);
  }
}

// =====================================================
// OUTPUT CONTROL
// =====================================================
void applyNormalOutputs() {
  digitalWrite(Lampu_biru, lampuBiruState);
  digitalWrite(Lampu_hijau, lampuHijauState);
  digitalWrite(Lampu_merah, lampuMerahState);
  analogWrite(Lampu_putih, lampuPutihPWM);
  analogWrite(Kipas_angin, kipasPWM);
  digitalWrite(Bell, bellState);
}

void setLampuBiru(int state) {
  lampuBiruState = state ? HIGH : LOW;
  if (!fireActive) digitalWrite(Lampu_biru, lampuBiruState);
}

void setLampuHijau(int state) {
  lampuHijauState = state ? HIGH : LOW;
  if (!fireActive) digitalWrite(Lampu_hijau, lampuHijauState);
}

void setLampuMerah(int state) {
  lampuMerahState = state ? HIGH : LOW;
  if (!fireActive) digitalWrite(Lampu_merah, lampuMerahState);
}

void setLampuPutihPWM(int pwm) {
  lampuPutihPWM = constrain(pwm, 0, 255);
  if (!fireActive) analogWrite(Lampu_putih, lampuPutihPWM);
}

void setKipasPWM(int pwm) {
  kipasPWM = constrain(pwm, 0, 255);
  if (!fireActive) analogWrite(Kipas_angin, kipasPWM);
}

void setBell(int state) {
  bellState = state ? HIGH : LOW;
  if (!fireActive && !bellPatternActive) digitalWrite(Bell, bellState);
}

void setFireOutputs(bool alarmPulseOn) {
  // Buzzer dan lampu alarm mengikuti status mute.
  bool audibleVisualAlarm = fireActive &&
                            !fireMuted &&
                            alarmPulseOn;

  digitalWrite(Lampu_biru,  audibleVisualAlarm ? HIGH : LOW);
  digitalWrite(Lampu_hijau, audibleVisualAlarm ? HIGH : LOW);
  digitalWrite(Lampu_merah, audibleVisualAlarm ? HIGH : LOW);
  analogWrite(Lampu_putih,  audibleVisualAlarm ? 255 : 0);
  digitalWrite(Bell,         audibleVisualAlarm ? HIGH : LOW);

  // Kipas tetap maksimum selama kebakaran, termasuk ketika mute.
  analogWrite(Kipas_angin, getEffectiveFanPWM());
}

// =====================================================
// BELL PATTERN UNTUK COMMAND TELEGRAM "Bel"
// =====================================================
void startBellPattern(int beepCount) {
  if (fireActive) return;
  bellPatternActive = true;
  bellPatternOn = true;
  bellBeepsLeft = beepCount;
  lastBellPatternMillis = millis();
  digitalWrite(Bell, HIGH);
}

void updateBellPattern() {
  if (!bellPatternActive || fireActive) return;

  if (bellPatternOn && millis() - lastBellPatternMillis >= BELL_ON_MS) {
    digitalWrite(Bell, LOW);
    bellPatternOn = false;
    bellBeepsLeft--;
    lastBellPatternMillis = millis();

    if (bellBeepsLeft <= 0) {
      bellPatternActive = false;
      bellState = LOW;
      return;
    }
  }

  if (!bellPatternOn && millis() - lastBellPatternMillis >= BELL_OFF_MS) {
    digitalWrite(Bell, HIGH);
    bellPatternOn = true;
    lastBellPatternMillis = millis();
  }
}

