Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
// =====================================================
// LCD NORMAL
// =====================================================
void showNormalLCD(String statusText = "Status:Aman") {
  if (fireActive) return;

  String line0;
  if (isnan(temp) || isnan(humi)) {
    line0 = "T=--C,H=--%";
  } else {
    line0 = "T=" + String(temp, 0) + "C,H=" + String(humi, 0) + "%";
  }
  lcdPrintLine(0, line0);
  lcdPrintLine(1, statusText);
}

// =====================================================
// BACA SENSOR DHT22
// =====================================================
void read_DHT22() {
  float h = dht.readHumidity();
  float t = dht.readTemperature();

  if (isnan(h) || isnan(t)) {
    Serial.println("Gagal membaca DHT22");
    if (!fireActive) showNormalLCD("Status:DHT Error");
    return;
  }

  humi = h;
  temp = t;

  // Update simulated ML / adaptive model
  addAdaptiveTemperatureSample(temp);

  Serial.print("[DHT] T=");
  Serial.print(temp, 1);
  Serial.print("C H=");
  Serial.print(humi, 1);
  Serial.println("%");
}

// =====================================================
// FIRE ALARM
// =====================================================
String fireMessage() {
  String msg = "KEBAKARAN TERDETEKSI!\n";
  msg += "Suhu: ";
  if (isnan(temp)) msg += "--";
  else msg += String(temp, 1);
  msg += " C\n";
  msg += "Gas/Asap: ";
  msg += isGasDetected() ? "TERDETEKSI" : "Tidak terdeteksi";
  msg += "\nPintu magnet: ";
  msg += isDoorOpen() ? "TERBUKA" : "TERTUTUP";
  msg += "\nKipas: MENYALA MAKSIMUM";
  msg += "\nServo: MEMBUKA PINTU";
  msg += "\nSegera periksa lokasi!";
  return msg;
}

void showFireLCD() {
  lcdPrintLine(0, "!! KEBAKARAN !!");
  String line1 = "T:";
  if (isnan(temp)) line1 += "--";
  else line1 += String(temp, 0);
  line1 += "C G:";
  line1 += isGasDetected() ? "YA" : "NO";
  lcdPrintLine(1, line1);
}

unsigned long fireMuteRemainingSeconds() {
  if (!fireMuted) return 0;
  unsigned long elapsed = millis() - lastFireMuteMillis;
  if (elapsed >= FIRE_MUTE_MS) return 0;
  return (FIRE_MUTE_MS - elapsed) / 1000UL;
}

void showFireMutedLCD() {
  lcdPrintLine(0, "ALARM DIMATIKAN");
  String line1 = "Sisa:" + String(fireMuteRemainingSeconds()) + " dtk";
  lcdPrintLine(1, line1);
}

bool muteFireAlarmFromSource(const char* source) {
  if (!fireActive) {
    fireMuted = false;
    applyNormalOutputs();
    showNormalLCD("Alarm tdk aktif");
    return false;
  }

  // Perintah mute berulang hanya memperpanjang waktu, bukan membuat event duplikat.
  if (fireMuted) {
    lastFireMuteMillis = millis();
    showFireMutedLCD();
    return true;
  }

  fireMuted = true;
  lastFireMuteMillis = millis();
  enqueueEvent("ALARM_MUTED", true, source);
  fireBlinkState = false;
  setFireOutputs(false);
  lcd.clear();
  showFireMutedLCD();
  Serial.println("==> Buzzer dan lampu alarm dimatikan sementara; kipas tetap maksimum");
  return true;
}

bool muteFireAlarm() {
  return muteFireAlarmFromSource("TELEGRAM");
}

void unmuteFireAlarmFromSource(const char* source) {
  bool wasMuted = fireMuted;
  fireMuted = false;
  lastFireMuteMillis = 0;

  if (wasMuted && fireActive) {
    enqueueEvent("ALARM_UNMUTED", false, source);
  }

  if (fireActive) {
    // Buzzer dan lampu melanjutkan pola alarm; kipas sejak awal tetap maksimum.
    setFireOutputs(false);
    lcd.clear();
    showFireLCD();
    Serial.println("==> Buzzer dan lampu alarm diaktifkan kembali; kipas tetap maksimum");
  } else {
    showNormalLCD("Status:Aman");
  }
}

void unmuteFireAlarm() {
  unmuteFireAlarmFromSource("TELEGRAM");
}

void updateFireAlarm() {

  bool gasDetected = isGasDetected();
  bool suhuValid = !isnan(temp);

  // ===================================================
  // ACTIVE THRESHOLD
  // ===================================================
  float activeWarningThreshold = adaptiveModelReady() ? adaptiveWarningThreshold : FIRE_TEMP_THRESHOLD - 2.0;
  float activeFireThreshold = adaptiveModelReady() ? adaptiveFireThreshold : FIRE_TEMP_THRESHOLD;
  float activeClearThreshold = adaptiveModelReady() ? adaptiveClearThreshold : FIRE_TEMP_CLEAR_THRESHOLD;

  // ===================================================
  // TEMPERATURE CONDITION
  // ===================================================
  bool suhuWarning = suhuValid && temp >= activeWarningThreshold;
  bool suhuTinggi = suhuValid && temp >= activeFireThreshold;
  // Tetap hard-coded sebagai safety limit
  bool suhuKritis = suhuValid && temp >= FIRE_CRITICAL_TEMP;

  // ===================================================
  // FIRE CONDITION
  // ===================================================
  bool fireCondition = (gasDetected && suhuTinggi) || suhuKritis;
  bool clearCondition = !gasDetected && suhuValid && temp <= activeClearThreshold;

  // ===================================================
  // RISK CLASSIFICATION
  // ===================================================
  if (fireCondition) {
    adaptiveRiskStatus = RISK_DANGER;
  }
  else if (gasDetected || suhuWarning) {
    adaptiveRiskStatus = RISK_WARNING;
  }
  else {
    adaptiveRiskStatus = RISK_SAFE;
  }

  if (fireCondition && !fireActive) {
    fireActive = true;
    fireNotifiedTelegram = false;
    fireBlinkState = false;
    fireMuted = false;
    fireServoDone = false;
    bellPatternActive = false;
    lastFireMuteMillis = 0;
    lastFireBlinkMillis = 0;
    lastFireLcdMillis = 0;
    lastFireTelegramTryMillis = 0;
    fireTelegramTryCount = 0;

    // Simpan kondisi awal sensor. Setelah ini, perubahan gas atau pintu
    // selama kebakaran tetap dapat mengirim notifikasi Telegram.
    fg = gasDetected;
    fm = isDoorOpen();

    enqueueEvent("FIRE_STARTED", true, "LOCAL_EDGE");

    // Kipas langsung menyala penuh. Lampu dan buzzer mulai dari OFF,
    // lalu berkedip berdasarkan FIRE_BLINK_MS.
    setFireOutputs(false);

    Serial.println("==> KEBAKARAN TERDETEKSI - KIPAS MENYALA");

    // Pintu dibuka satu kali ketika kebakaran baru terdeteksi.
    triggerFireServoOpen();

    lcd.clear();
    showFireLCD();

