Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
    fireNotifiedTelegram = sendTelegram(fireMessage());
    lastFireTelegramTryMillis = millis();
    fireTelegramTryCount = 1;
  }

  if (!fireActive) return;

  if (!fireNotifiedTelegram &&
      fireTelegramTryCount < FIRE_TELEGRAM_MAX_TRY &&
      millis() - lastFireTelegramTryMillis >= FIRE_TELEGRAM_RETRY_MS) {
    lastFireTelegramTryMillis = millis();
    fireTelegramTryCount++;
    fireNotifiedTelegram = sendTelegram(fireMessage());
  }

  // Jika kondisi sudah aman, alarm otomatis kembali normal.
  if (clearCondition) {
    fireActive = false;
    fireNotifiedTelegram = false;
    fireBlinkState = false;
    fireMuted = false;
    fireServoDone = false;
    lastFireMuteMillis = 0;
    lastFireTelegramTryMillis = 0;
    fireTelegramTryCount = 0;

    // Alarm selesai: kipas kembali ke nilai yang sebelumnya diminta pengguna.
    // Servo tidak menutup pintu secara otomatis.
    setFireOutputs(false);
    applyNormalOutputs();
    enqueueEvent("FIRE_CLEARED", false, "LOCAL_EDGE");

    String clearMessage =
      "Status kebakaran kembali NORMAL. Gas/asap aman dan suhu sudah turun. "
      "Kipas kembali ke pengaturan pengguna (PWM ";
    clearMessage += String(kipasPWM);
    clearMessage += "). Pintu tetap terbuka dan dapat ditutup kembali dari Telegram.";
    sendTelegram(clearMessage);

    Serial.print("==> Status kebakaran normal - kipas kembali ke PWM ");
    Serial.println(kipasPWM);
    showNormalLCD("Status:Aman");
    return;
  }

  // Mute hanya sementara. Setelah 1 menit, alarm fisik aktif lagi bila kondisi masih kebakaran.
  if (fireMuted && millis() - lastFireMuteMillis >= FIRE_MUTE_MS) {
    fireMuted = false;
    lastFireMuteMillis = 0;
    enqueueEvent("ALARM_MUTE_EXPIRED", false, "LOCAL_TIMER");
    setFireOutputs(false);
    lcd.clear();
    showFireLCD();
    sendTelegram(
      "Waktu mute alarm sudah habis. Karena kondisi kebakaran masih terdeteksi, "
      "buzzer dan lampu alarm aktif kembali. Kipas tetap maksimum."
    );
    Serial.println("==> Waktu mute selesai, buzzer dan lampu aktif kembali; kipas tetap maksimum");
  }

  if (fireMuted) {
    setFireOutputs(false); // buzzer dan lampu alarm tetap mati, status kebakaran tetap aktif
    if (millis() - lastFireLcdMillis >= FIRE_LCD_MS) {
      lastFireLcdMillis = millis();
      showFireMutedLCD();
    }
    return;
  }

  if (millis() - lastFireBlinkMillis >= FIRE_BLINK_MS) {
    lastFireBlinkMillis = millis();
    fireBlinkState = !fireBlinkState;
    setFireOutputs(fireBlinkState);
  }

  if (millis() - lastFireLcdMillis >= FIRE_LCD_MS) {
    lastFireLcdMillis = millis();
    showFireLCD();
  }
}

// =====================================================
// MONITOR GAS DAN PINTU NORMAL
// =====================================================
void cek_MQ() {
  bool gasDetected = isGasDetected();

  if (gasDetected && !fg) {
    fg = true;
    Serial.println("==> Gas/asap terdeteksi");
    sendTelegram("AWAS! Gas/asap terdeteksi oleh sensor MQ2.\n" + getSensorIndicatorText());
    showNormalLCD("Status:AWAS GAS");
  }
  else if (!gasDetected && fg) {
    fg = false;
    sendTelegram("AMAN! Gas/asap sudah tidak terdeteksi oleh sensor MQ2.\n" + getSensorIndicatorText());
    showNormalLCD("Status:Aman");
  }
}

void cek_Magnet() {
  bool doorOpen = isDoorOpen();

  if (doorOpen && !fm) {
    fm = true;
    Serial.println("==> Pintu terbuka terdeteksi");
    sendTelegram("AWAS! Pintu terbuka terdeteksi.\n" + getSensorIndicatorText());
    showNormalLCD("Status:AWS PINTU");
  }
  else if (!doorOpen && fm) {
    fm = false;
    Serial.println("==> Pintu kembali tertutup");
    sendTelegram("AMAN! Pintu kembali tertutup.\n" + getSensorIndicatorText());
    showNormalLCD("Status:Aman");
  }
}

// =====================================================
// STATUS DAN COMMAND TELEGRAM
// =====================================================
String getStatusText() {
  String s = "ESP32 Smart Home\n";
  s += "Suhu: ";
  if (isnan(temp)) s += "--";
  else s += String(temp, 1);
  s += " C\n";
  s += "Kelembaban: ";
  if (isnan(humi)) s += "--";
  else s += String(humi, 1);
  s += " %\n";
  s += "Gas/Asap: ";
  s += isGasDetected() ? "TERDETEKSI" : "Aman";
  s += "\nPintu: ";
  s += isDoorOpen() ? "Terbuka" : "Tertutup";
  s += "\nKebakaran: ";
  s += fireActive ? "YA" : "Tidak";
  s += "\nAlarm fisik: ";
  if (fireActive && fireMuted) {
    s += "DIMATIKAN SEMENTARA (sisa ";
    s += String(fireMuteRemainingSeconds());
    s += " dtk)";
  } else if (fireActive) {
    s += "AKTIF";
  } else {
    s += "Normal";
  }
  s += "\n\nOutput:";
  s += "\nLampu biru: ";
  s += onOff(lampuBiruState);
  s += "\nLampu hijau: ";
  s += onOff(lampuHijauState);
  s += "\nLampu merah: ";
  s += onOff(lampuMerahState);
  s += "\nLampu putih PWM: ";
  s += String(lampuPutihPWM);
  s += "\nKipas PWM diminta: ";
  s += String(kipasPWM);
  s += "\nKipas PWM efektif: ";
  s += String(getEffectiveFanPWM());
  if (fireActive) {
    s += fireMuted
      ? " (kebakaran; buzzer/lampu dimute)"
      : " (mode kebakaran)";
  }

  s += "\n\nServo pintu:";
  s += "\nMode: ";
  s += SERVO_360_CONTINUOUS ? "Continuous/360" : "Standar 0-180";
  s += "\nStatus servo: ";
  s += servoDoorOpen ? "Terbuka" : "Tertutup";
  s += "\nPerintah servo: ";
  s += String(servoCommand);

  if (servoTimedMoveActive) {
    s += "\nGerakan servo: BERJALAN";
  }

  return s;
}

String helpText() {
  String h = "Command ESP32 Smart Home:\n";
  h += "Cek rumah / /status / /sensor\n";
  h += "Biru on | Biru off\n";
  h += "Hijau on | Hijau off\n";
  h += "Merah on | Merah off\n";
  h += "Putih 1 | Putih 2 | Putih 3 | Putih off\n";
  h += "Lampu on | Lampu off\n";
  h += "Kipas 1 | Kipas 2 | Kipas 3 | Kipas off\n";
  h += "Bel\n";
  h += "Pintu buka | Pintu tutup\n";
  h += "Servo 0 ... Servo 180\n";
  h += "Semua on | Semua off\n";
  h += "Alarm off / /mute = matikan alarm sementara\n";
  h += "Alarm on / /unmute = aktifkan alarm kembali\n";
  h += "Help";
  return h;
}

void newMsg(FB_msg& msg) {
  if (telegramConfigured() && msg.chatID != String(CHAT_ID)) {
    return;
  }

  String cmd = msg.text;
  cmd.trim();
  String lower = cmd;
  lower.toLowerCase();

  if (lower == "/start" || lower == "help" || lower == "/help") {
    sendTelegram(helpText());
  }
  else if (lower == "cek rumah" || lower == "/status" || lower == "status" ||
           lower == "/sensor" || lower == "status sensor") {
    sendTelegram(getStatusText());
  }
  else if (lower == "alarm off" || lower == "matikan alarm" || lower == "/mute" || lower == "mute") {
    if (muteFireAlarm()) {
      sendTelegram(
        "Buzzer dan lampu alarm dimatikan sementara selama 1 menit. "
        "Kipas tetap maksimum dan servo tetap terbuka selama kebakaran."
      );
    } else {
      sendTelegram("Alarm kebakaran sedang tidak aktif.");
    }
  }
  else if (lower == "alarm on" || lower == "nyalakan alarm" || lower == "/unmute" || lower == "unmute") {
    unmuteFireAlarm();
    if (fireActive) sendTelegram("Buzzer dan lampu alarm diaktifkan kembali. Kipas tetap maksimum.");
    else sendTelegram("Alarm kebakaran sedang tidak aktif.");
  }
  else if (lower == "biru on") {
    setLampuBiru(HIGH);
    sendTelegram("Lampu biru: ON");
  }
  else if (lower == "biru off") {
    setLampuBiru(LOW);
    sendTelegram("Lampu biru: OFF");
  }
  else if (lower == "hijau on") {
    setLampuHijau(HIGH);
    sendTelegram("Lampu hijau: ON");
  }
  else if (lower == "hijau off") {
    setLampuHijau(LOW);
    sendTelegram("Lampu hijau: OFF");
  }
  else if (lower == "merah on") {
    setLampuMerah(HIGH);
    sendTelegram("Lampu merah: ON");
  }
  else if (lower == "merah off") {
    setLampuMerah(LOW);
    sendTelegram("Lampu merah: OFF");
  }
  else if (lower == "putih 1") {
    setLampuPutihPWM(85);
    sendTelegram("Lampu putih: redup");
  }
  else if (lower == "putih 2") {
    setLampuPutihPWM(170);
    sendTelegram("Lampu putih: sedang");
  }
  else if (lower == "putih 3") {
    setLampuPutihPWM(255);
    sendTelegram("Lampu putih: terang");
  }
  else if (lower == "putih off" || lower == "putih 0") {
    setLampuPutihPWM(0);
    sendTelegram("Lampu putih: OFF");
  }
  else if (lower == "lampu on") {
    setLampuBiru(HIGH);
    setLampuHijau(HIGH);
    setLampuMerah(HIGH);
    setLampuPutihPWM(255);
    sendTelegram("Semua lampu dinyalakan");
  }
  else if (lower == "lampu off") {
    setLampuBiru(LOW);
    setLampuHijau(LOW);
    setLampuMerah(LOW);
    setLampuPutihPWM(0);
    sendTelegram("Semua lampu dimatikan");
  }
  else if (lower == "kipas 1") {
    setKipasPWM(120);
    sendTelegram("Kipas: lambat");
  }
  else if (lower == "kipas 2") {
    setKipasPWM(170);
    sendTelegram("Kipas: sedang");
  }
  else if (lower == "kipas 3") {
    setKipasPWM(255);
    sendTelegram("Kipas: cepat");
  }
  else if (lower == "kipas off" || lower == "kipas 0") {
    setKipasPWM(0);
    sendTelegram("Kipas: OFF");
  }
  else if (
    lower == "pintu buka" ||
    lower == "servo buka" ||
    lower == "/buka" ||
    lower == "/open"
  ) {
    if (fireActive) {
      triggerFireServoOpen();
      sendTelegram("Pintu dipertahankan TERBUKA karena status kebakaran masih aktif.");
    } else {
      setDoorServo(true);
      sendTelegram("Servo membuka pintu.");
    }
  }
  else if (
    lower == "pintu tutup" ||
    lower == "servo tutup" ||
    lower == "/tutup" ||
    lower == "/close"
  ) {
    if (!setDoorServo(false)) {
      sendTelegram("Pintu tidak dapat ditutup selama status kebakaran masih aktif.");
    } else {
      sendTelegram("Servo menutup pintu.");
    }
  }
  else if (lower.startsWith("servo ")) {
    String angleText = lower.substring(6);
    angleText.trim();

