Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
    bool numeric = angleText.length() > 0;
    for (unsigned int i = 0; i < angleText.length(); i++) {
      if (!isDigit(angleText.charAt(i))) {
        numeric = false;
        break;
      }
    }

    int angle = numeric ? angleText.toInt() : -1;

    if (!numeric || angle < 0 || angle > 180) {
      sendTelegram("Nilai servo harus berupa angka 0 sampai 180. Contoh: Servo 90");
    }
    else if (fireActive) {
      triggerFireServoOpen();
      sendTelegram("Kontrol sudut servo diabaikan karena kebakaran aktif. Pintu dipertahankan terbuka.");
    }
    else if (SERVO_360_CONTINUOUS) {
      servoTimedMoveActive = false;
      writeServoRaw(angle);
      servoDoorOpen = (angle == SERVO_360_OPEN_SPEED);

      String reply = "Perintah servo continuous: ";
      reply += String(angle);
      reply += ". Gunakan Servo 90 untuk berhenti.";
      sendTelegram(reply);
    }
    else {
      setServoAngle(angle);
      sendTelegram("Sudut servo diatur ke " + String(angle) + " derajat.");
    }
  }
  else if (lower == "bel" || lower == "bell") {
    startBellPattern(3);
    sendTelegram("Bell dibunyikan.");
  }
  else if (lower == "semua off") {
    setLampuBiru(LOW);
    setLampuHijau(LOW);
    setLampuMerah(LOW);
    setLampuPutihPWM(0);
    setKipasPWM(0);
    sendTelegram("Semua dimatikan.");
  }
  else if (lower == "semua on") {
    setLampuBiru(HIGH);
    setLampuHijau(HIGH);
    setLampuMerah(HIGH);
    setLampuPutihPWM(255);
    setKipasPWM(255);
    startBellPattern(3);
    sendTelegram("Semua dinyalakan.");
  }
  else {
    sendTelegram("Format salah. Ketik Help untuk melihat daftar command.");
  }

  if (fireActive && !fireMuted) {
    sendTelegram("Catatan: alarm kebakaran sedang aktif. Output fisik mengikuti mode alarm sampai kondisi aman atau alarm dimatikan sementara.");
  }

  immediateTelemetryRequested = true;
}

// =====================================================
// CONNECTION MANAGEMENT
// =====================================================
void startWiFi() {
  Serial.print("Memulai koneksi WiFi ke ");
  Serial.println(ssid);

  WiFi.mode(WIFI_STA);

  // Mengurangi kemungkinan koneksi MQTT terputus karena power-save Wi-Fi.
  WiFi.setSleep(false);

  WiFi.begin(ssid, pass);
  lastWiFiAttemptMillis = millis();
}

void maintainWiFi() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  if (millis() - lastWiFiAttemptMillis < 15000UL) {
    return;
  }

  lastWiFiAttemptMillis = millis();
  Serial.println("Mencoba reconnect WiFi...");
  WiFi.disconnect();
  WiFi.begin(ssid, pass);
}

bool connectThingsBoard() {
  if (!thingsBoardConfigured()) {
    Serial.println("ThingsBoard belum dikonfigurasi. Cek secrets.h.");
    return false;
  }

  if (WiFi.status() != WL_CONNECTED) {
    return false;
  }

  if (tbMqttClient.connected()) {
    return true;
  }

  String clientId = "ESP32-SmartHome-";
  clientId += WiFi.macAddress();
  clientId.replace(":", "");

  Serial.print("Menghubungkan ThingsBoard MQTT ke ");
  Serial.print(TB_HOST);
  Serial.print(":");
  Serial.println(TB_PORT);

  bool connected = tbMqttClient.connect(
    clientId.c_str(),
    TB_ACCESS_TOKEN,
    nullptr
  );

  if (connected) {
    Serial.println("ThingsBoard MQTT terhubung.");

    rpcSubscribed = tbMqttClient.subscribe(TB_RPC_REQUEST_TOPIC);
    lastRpcSubscribeMillis = millis();

    Serial.print("Subscribe RPC ");
    Serial.print(TB_RPC_REQUEST_TOPIC);
    Serial.print(": ");
    Serial.println(rpcSubscribed ? "BERHASIL" : "GAGAL");
  } else {
    rpcSubscribed = false;
    Serial.print("ThingsBoard MQTT gagal. State=");
    Serial.println(tbMqttClient.state());
  }

  return connected;
}

void maintainThingsBoard() {
  if (WiFi.status() != WL_CONNECTED) {
    if (tbMqttClient.connected()) {
      tbMqttClient.disconnect();
    }
    rpcSubscribed = false;
    return;
  }

  if (tbMqttClient.connected()) {
    if (!rpcSubscribed &&
        millis() - lastRpcSubscribeMillis >= RPC_SUBSCRIBE_RETRY_MS) {
      lastRpcSubscribeMillis = millis();
      rpcSubscribed = tbMqttClient.subscribe(TB_RPC_REQUEST_TOPIC);

      Serial.print("Retry subscribe RPC: ");
      Serial.println(rpcSubscribed ? "BERHASIL" : "GAGAL");
    }

    tbMqttClient.loop();
    return;
  }

  rpcSubscribed = false;

  if (millis() - lastMqttRetryMillis < MQTT_RETRY_MS) {
    return;
  }

  lastMqttRetryMillis = millis();
  connectThingsBoard();
}

bool publishTelemetry() {
  if (!tbMqttClient.connected()) {
    return false;
  }

  bool gasDetected = isGasDetected();
  bool doorOpen = isDoorOpen();
  bool dhtValid = !isnan(temp) && !isnan(humi);

  String payload;
  payload.reserve(1100);
  payload += "{";

  bool hasPreviousField = false;

  if (dhtValid) {
    payload += "\"temperature\":";
    payload += String(temp, 1);
    payload += ",\"humidity\":";
    payload += String(humi, 1);
    hasPreviousField = true;
  }

  if (hasPreviousField) payload += ",";
  payload += "\"gas_detected\":";
  payload += gasDetected ? "true" : "false";

  payload += ",\"door_open\":";
  payload += doorOpen ? "true" : "false";

  payload += ",\"fire_active\":";
  payload += fireActive ? "true" : "false";
  // ===================================================
  // ADAPTIVE INTELLIGENCE TELEMETRY
  // ===================================================
  payload += ",\"adaptive_ready\":";
  payload += adaptiveModelReady() ? "true" : "false";

  payload += ",\"adaptive_sample_count\":";
  payload += String(adaptiveTempCount);

  if (!isnan(adaptiveBaselineTemp)) {
    payload += ",\"temp_baseline\":";
    payload += String(adaptiveBaselineTemp, 1);
  }

  payload += ",\"temp_warning_threshold\":";
  payload += String(adaptiveWarningThreshold, 1);

  payload += ",\"temp_fire_threshold\":";
  payload += String(adaptiveFireThreshold, 1);

  payload += ",\"temp_clear_threshold\":";
  payload += String(adaptiveClearThreshold, 1);

  payload += ",\"risk_status\":\"";
  payload += getAdaptiveRiskStatusText();
  payload += "\"";

  payload += ",\"fire_muted\":";
  payload += fireMuted ? "true" : "false";

  payload += ",\"alarm_audible\":";
  payload += getAlarmAudible() ? "true" : "false";

  payload += ",\"lamp_blue\":";
  payload += getAlarmLampLogicalState(lampuBiruState) ? "true" : "false";

