Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
  payload += ",\"lamp_green\":";
  payload += getAlarmLampLogicalState(lampuHijauState) ? "true" : "false";

  payload += ",\"lamp_red\":";
  payload += getAlarmLampLogicalState(lampuMerahState) ? "true" : "false";

  payload += ",\"lamp_white_pwm\":";
  payload += String(getAlarmWhiteLampLogicalPWM());

  payload += ",\"fan_pwm_requested\":";
  payload += String(kipasPWM);

  payload += ",\"fan_pwm_effective\":";
  payload += String(getEffectiveFanPWM());

  payload += ",\"buzzer_active\":";
  payload += getBuzzerActiveTelemetry() ? "true" : "false";

  payload += ",\"buzzer_mode\":\"";
  payload += getBuzzerMode();
  payload += "\"";

  payload += ",\"servo_angle\":";
  payload += String(servoCommand);

  payload += ",\"servo_door_open\":";
  payload += servoDoorOpen ? "true" : "false";

  payload += ",\"wifi_status\":true";

  payload += ",\"wifi_rssi\":";
  payload += String(WiFi.RSSI());

  payload += ",\"thingsboard_connected\":true";

  payload += ",\"uptime_seconds\":";
  payload += String(millis() / 1000UL);

  payload += ",\"buffer_count\":";
  payload += String(eventCount);

  payload += ",\"persistent_buffer_count\":";
  payload += String(persistentStoredCount);

  payload += ",\"persistent_buffer_restored\":";
  payload += persistentBufferRestored ? "true" : "false";

  payload += ",\"persistent_storage_ok\":";
  payload += persistentStorageOk ? "true" : "false";

  payload += ",\"persistent_save_count\":";
  payload += String(persistentSaveCount);

  payload += ",\"last_event\":\"";
  payload += lastEventType;
  payload += "\"";

  payload += ",\"event_sequence\":";
  payload += String(eventSequence);

  // ===================================================
  // SECURITY TELEMETRY
  // ===================================================
  payload += ",\"auth_status\":\"";
  payload += lastAuthStatus;
  payload += "\"";

  payload += ",\"auth_failed_count\":";
  payload += String(authFailedCount);

  payload += ",\"security_locked\":";
  payload += securityLocked ? "true" : "false";

  payload += ",\"last_auth_source\":\"";
  payload += lastAuthSource;
  payload += "\"";

  payload += ",\"lamp_blue_requested\":";
  payload += lampuBiruState == HIGH ? "true" : "false";

  payload += ",\"lamp_green_requested\":";
  payload += lampuHijauState == HIGH ? "true" : "false";

  payload += ",\"lamp_red_requested\":";
  payload += lampuMerahState == HIGH ? "true" : "false";

  payload += ",\"lamp_white_pwm_requested\":";
  payload += String(lampuPutihPWM);

  payload += ",\"lamp_blue_effective\":";
  payload += getAlarmLampLogicalState(lampuBiruState)
    ? "true"
    : "false";

  payload += ",\"lamp_green_effective\":";
  payload += getAlarmLampLogicalState(lampuHijauState)
    ? "true"
    : "false";

  payload += ",\"lamp_red_effective\":";
  payload += getAlarmLampLogicalState(lampuMerahState)
    ? "true"
    : "false";

  payload += ",\"lamp_white_pwm_effective\":";
  payload += String(getAlarmWhiteLampLogicalPWM());

  payload += "}";

  bool published = tbMqttClient.publish(
    TB_TELEMETRY_TOPIC,
    payload.c_str()
  );

  Serial.print("Publish ThingsBoard: ");
  Serial.println(published ? "BERHASIL" : "GAGAL");

  if (published) {
    Serial.println(payload);
  }

  return published;
}


// =====================================================
// THINGSBOARD RPC
// =====================================================
String jsonValueRaw(const String& json, const char* key) {
  String token = "\"";
  token += key;
  token += "\"";

  int keyIndex = json.indexOf(token);
  if (keyIndex < 0) return "";

  int colonIndex = json.indexOf(':', keyIndex + token.length());
  if (colonIndex < 0) return "";

  int start = colonIndex + 1;
  while (start < (int)json.length() &&
         (json.charAt(start) == ' ' ||
          json.charAt(start) == '\t' ||
          json.charAt(start) == '\r' ||
          json.charAt(start) == '\n')) {
    start++;
  }

  if (start >= (int)json.length()) return "";

  if (json.charAt(start) == '"') {
    int endQuote = json.indexOf('"', start + 1);
    if (endQuote < 0) return "";
    return json.substring(start + 1, endQuote);
  }

  int end = start;
  while (end < (int)json.length() &&
         json.charAt(end) != ',' &&
         json.charAt(end) != '}') {
    end++;
  }

  String result = json.substring(start, end);
  result.trim();
  return result;
}

// =====================================================
// RPC SECURITY HELPER
// =====================================================

// Mengecek apakah security token sudah benar-benar dikonfigurasi.
// Jika masih menggunakan placeholder, protected RPC akan fail-closed.
bool rpcSecurityConfigured() {
  String configuredToken = String(RPC_SECURITY_TOKEN);
  configuredToken.trim();

  return configuredToken.length() >= 8 &&
         configuredToken != "ISI_RPC_SECURITY_TOKEN";
}

// Hanya RPC yang mengubah kondisi perangkat yang membutuhkan token.
// Getter tetap diperbolehkan tanpa token.
bool isProtectedRpcMethod(const String& method) {
  return
    method == "setLampBlue"  ||
    method == "setLampGreen" ||
    method == "setLampRed"   ||
    method == "setWhitePwm"  ||
    method == "setFanPwm"    ||
    method == "openDoor"     ||
    method == "closeDoor"    ||
    method == "ringBell"     ||
    method == "muteAlarm"    ||
    method == "unmuteAlarm";
}

void activateSecurityLock() {
  if (securityLocked) {
    return;
  }

  securityLocked = true;
  securityLockStartedMillis = millis();
  lastAuthStatus = "LOCKED";

  enqueueEvent(
    "SECURITY_LOCKED",
    true,
    "THINGSBOARD_RPC"
  );

  immediateTelemetryRequested = true;

  Serial.println();
  Serial.println("================================");
  Serial.println("[SECURITY] SECURITY LOCK ACTIVE");
  Serial.print("[SECURITY] Failed attempts : ");
  Serial.println(authFailedCount);
  Serial.println("[SECURITY] Protected RPC diblokir selama 30 detik.");
  Serial.println("================================");
}

void registerAuthenticationFailure() {
  if (authFailedCount < AUTH_MAX_FAILED_ATTEMPTS) {
    authFailedCount++;
  }

  if (authFailedCount >= AUTH_MAX_FAILED_ATTEMPTS) {
    activateSecurityLock();
  } else {
    lastAuthStatus = "FAILED";
  }

