Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
  immediateTelemetryRequested = true;
}

// Validasi application-level token pada RPC protected.
// Token TIDAK pernah dicetak ke Serial Monitor.
bool validateProtectedRpcToken(
  const String& requestBody,
  String& errorMessage
) {
  lastAuthSource = "THINGSBOARD_RPC";

  // Fail-closed bila token belum dikonfigurasi.
  if (!rpcSecurityConfigured()) {
    lastAuthStatus = "NOT_CONFIGURED";
    errorMessage = "security_not_configured";

    Serial.println(
      "[SECURITY] RPC ditolak: RPC security token belum dikonfigurasi."
    );

    immediateTelemetryRequested = true;
    return false;
  }

  // ===================================================
  // SECURITY LOCK CHECK
  // ===================================================
  // Ketika lock aktif, bahkan token yang benar tetap ditolak.
  if (securityLocked) {
    lastAuthStatus = "LOCKED";
    errorMessage = "security_locked";

    Serial.println(
      "[SECURITY] RPC ditolak: temporary security lock masih aktif."
    );

    return false;
  }

  String suppliedToken = jsonValueRaw(requestBody, "token");

  // ===================================================
  // TOKEN TIDAK ADA
  // ===================================================
  if (suppliedToken.length() == 0) {

    registerAuthenticationFailure();

    errorMessage = "missing_security_token";

    Serial.print(
      "[SECURITY] RPC ditolak: security token tidak ditemukan. Failed="
    );
    Serial.println(authFailedCount);

    return false;
  }

  // ===================================================
  // TOKEN SALAH
  // ===================================================
  if (suppliedToken != String(RPC_SECURITY_TOKEN)) {

    registerAuthenticationFailure();

    errorMessage = "invalid_security_token";

    Serial.print(
      "[SECURITY] RPC ditolak: security token tidak valid. Failed="
    );
    Serial.println(authFailedCount);

    return false;
  }

  // ===================================================
  // TOKEN VALID
  // ===================================================
  authFailedCount = 0;
  lastAuthStatus = "SUCCESS";
  lastAuthSource = "THINGSBOARD_RPC";
  errorMessage = "";

  immediateTelemetryRequested = true;

  Serial.println(
    "[SECURITY] RPC authentication SUCCESS."
  );

  return true;
}

void updateSecurityLock() {
  if (!securityLocked) {
    return;
  }

  if (millis() - securityLockStartedMillis < SECURITY_LOCK_MS) {
    return;
  }

  securityLocked = false;
  securityLockStartedMillis = 0;
  authFailedCount = 0;

  lastAuthStatus = "UNLOCKED";
  lastAuthSource = "LOCAL_TIMER";

  enqueueEvent(
    "SECURITY_UNLOCKED",
    false,
    "LOCAL_TIMER"
  );

  immediateTelemetryRequested = true;

  Serial.println();
  Serial.println("================================");
  Serial.println("[SECURITY] SECURITY LOCK RELEASED");
  Serial.println("[SECURITY] Authentication counter kembali ke 0.");
  Serial.println("[SECURITY] Protected RPC dapat digunakan kembali.");
  Serial.println("================================");
}

bool parseRpcBool(const String& rawValue, bool& result) {
  String value = rawValue;
  value.trim();
  value.toLowerCase();

  if (value == "true" || value == "1" || value == "on") {
    result = true;
    return true;
  }

  if (value == "false" || value == "0" || value == "off") {
    result = false;
    return true;
  }

  return false;
}

bool parseRpcInt(const String& rawValue, int& result) {
  String value = rawValue;
  value.trim();

  if (value.length() == 0) return false;

  int start = 0;
  if (value.charAt(0) == '-') {
    if (value.length() == 1) return false;
    start = 1;
  }

  for (int i = start; i < (int)value.length(); i++) {
    if (!isDigit(value.charAt(i))) return false;
  }

  result = value.toInt();
  return true;
}

bool publishRpcResponse(const String& requestId, const String& responseJson) {
  if (!tbMqttClient.connected() || requestId.length() == 0) {
    return false;
  }

  String responseTopic = TB_RPC_RESPONSE_PREFIX;
  responseTopic += requestId;

  bool published = tbMqttClient.publish(
    responseTopic.c_str(),
    responseJson.c_str()
  );

  Serial.print("RPC response ");
  Serial.print(responseTopic);
  Serial.print(": ");
  Serial.println(published ? "BERHASIL" : "GAGAL");

  if (published) {
    Serial.println(responseJson);
  }

  return published;
}

String rpcBaseResponse(bool success, const String& method, const String& message) {
  String response;
  response.reserve(220);
  response += "{\"success\":";
  response += success ? "true" : "false";
  response += ",\"method\":\"";
  response += method;
  response += "\",\"message\":\"";
  response += message;
  response += "\"";
  return response;
}

void thingsBoardRpcCallback(char* topic, byte* payload, unsigned int length) {
  String topicText = String(topic);

  String requestBody;
  requestBody.reserve(length + 1);
  for (unsigned int i = 0; i < length; i++) {
    requestBody += (char)payload[i];
  }

  int requestIdSeparator = topicText.lastIndexOf('/');
  String requestId = requestIdSeparator >= 0
    ? topicText.substring(requestIdSeparator + 1)
    : "";

  String method = jsonValueRaw(requestBody, "method");
  String params = jsonValueRaw(requestBody, "params");

  // Setter/action menggunakan struktur:
  // params: {
  //   "token": "...",
  //   "value": ...
  // }
  //
  // Karena parser existing sederhana, token dan value
  // dibaca langsung dari keseluruhan requestBody.
  bool protectedRpc = isProtectedRpcMethod(method);

  String rpcValue = protectedRpc
    ? jsonValueRaw(requestBody, "value")
    : params;


  Serial.println();
  Serial.println("=== THINGSBOARD RPC DITERIMA ===");

  Serial.print("Topic     : ");
  Serial.println(topicText);

  Serial.print("Method    : ");
  Serial.println(method);

  Serial.print("Protected : ");
  Serial.println(protectedRpc ? "YA" : "TIDAK");


  String response;
  bool commandProcessed = false;


  // =====================================================
  // SECURITY GATE
  // =====================================================
  if (protectedRpc) {
    String authError;

    if (!validateProtectedRpcToken(requestBody, authError)) {

      response = rpcBaseResponse(
        false,
        method,
        authError
      );

