Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
      response += ",\"auth_status\":\"";
      response += lastAuthStatus;
      response += "\"";

      response += ",\"auth_failed_count\":";
      response += String(authFailedCount);

      response += ",\"security_locked\":";
      response += securityLocked ? "true" : "false";

      response += "}";

      publishRpcResponse(
        requestId,
        response
      );

      // Nantinya security telemetry juga akan ikut dikirim
      // melalui mekanisme existing ini.
      immediateTelemetryRequested = true;

      Serial.println(
        "RPC diproses: TIDAK / AUTHENTICATION FAILED"
      );
      Serial.println(
        "================================"
      );

      return;
    }
  }

  if (method == "setLampBlue") {
    bool value;
    if (parseRpcBool(rpcValue, value)) {
      setLampuBiru(value ? HIGH : LOW);
      enqueueEvent("RPC_LAMP_BLUE", value, "THINGSBOARD_RPC");

      response = rpcBaseResponse(true, method, "lamp_blue_updated");
      response += ",\"requested\":";
      response += value ? "true" : "false";
      response += ",\"effective\":";
      response += getAlarmLampLogicalState(lampuBiruState) ? "true" : "false";
      response += "}";
      commandProcessed = true;
    } else {
      response = rpcBaseResponse(false, method, "invalid_boolean_params");
      response += "}";
    }
  }
  else if (method == "setLampGreen") {
    bool value;
    if (parseRpcBool(rpcValue, value)) {
      setLampuHijau(value ? HIGH : LOW);
      enqueueEvent("RPC_LAMP_GREEN", value, "THINGSBOARD_RPC");

      response = rpcBaseResponse(true, method, "lamp_green_updated");
      response += ",\"requested\":";
      response += value ? "true" : "false";
      response += ",\"effective\":";
      response += getAlarmLampLogicalState(lampuHijauState) ? "true" : "false";
      response += "}";
      commandProcessed = true;
    } else {
      response = rpcBaseResponse(false, method, "invalid_boolean_params");
      response += "}";
    }
  }
  else if (method == "setLampRed") {
    bool value;
    if (parseRpcBool(rpcValue, value)) {
      setLampuMerah(value ? HIGH : LOW);
      enqueueEvent("RPC_LAMP_RED", value, "THINGSBOARD_RPC");

      response = rpcBaseResponse(true, method, "lamp_red_updated");
      response += ",\"requested\":";
      response += value ? "true" : "false";
      response += ",\"effective\":";
      response += getAlarmLampLogicalState(lampuMerahState) ? "true" : "false";
      response += "}";
      commandProcessed = true;
    } else {
      response = rpcBaseResponse(false, method, "invalid_boolean_params");
      response += "}";
    }
  }
  else if (method == "setWhitePwm") {
    int value;
    if (parseRpcInt(rpcValue, value) && value >= 0 && value <= 255) {
      setLampuPutihPWM(value);
      enqueueEvent("RPC_WHITE_PWM", value > 0, "THINGSBOARD_RPC");

      response = rpcBaseResponse(true, method, "white_pwm_updated");
      response += ",\"requested\":";
      response += String(value);
      response += ",\"effective\":";
      response += String(getAlarmWhiteLampLogicalPWM());
      response += "}";
      commandProcessed = true;
    } else {
      response = rpcBaseResponse(false, method, "params_must_be_0_to_255");
      response += "}";
    }
  }
  else if (method == "setFanPwm") {
    int value;
    if (parseRpcInt(rpcValue, value) && value >= 0 && value <= 255) {
      setKipasPWM(value);
      enqueueEvent("RPC_FAN_PWM", value > 0, "THINGSBOARD_RPC");

      response = rpcBaseResponse(true, method, "fan_pwm_updated");
      response += ",\"requested\":";
      response += String(kipasPWM);
      response += ",\"effective\":";
      response += String(getEffectiveFanPWM());
      response += "}";
      commandProcessed = true;
    } else {
      response = rpcBaseResponse(false, method, "params_must_be_0_to_255");
      response += "}";
    }
  }
  else if (method == "openDoor") {
    bool accepted = setDoorServo(true);

    enqueueEvent(
      accepted ? "RPC_DOOR_OPEN" : "RPC_DOOR_OPEN_REJECTED",
      accepted,
      "THINGSBOARD_RPC"
    );

    response = rpcBaseResponse(
      accepted,
      method,
      accepted ? "door_opened" : "door_open_rejected"
    );
    response += ",\"servo_angle\":";
    response += String(servoCommand);
    response += ",\"servo_door_open\":";
    response += servoDoorOpen ? "true" : "false";
    response += "}";
    commandProcessed = accepted;
  }
  else if (method == "closeDoor") {
    bool accepted = setDoorServo(false);

    enqueueEvent(
      accepted ? "RPC_DOOR_CLOSE" : "RPC_DOOR_CLOSE_REJECTED",
      accepted,
      "THINGSBOARD_RPC"
    );

    response = rpcBaseResponse(
      accepted,
      method,
      accepted ? "door_closed" : "rejected_fire_active"
    );
    response += ",\"fire_active\":";
    response += fireActive ? "true" : "false";
    response += ",\"servo_angle\":";
    response += String(servoCommand);
    response += ",\"servo_door_open\":";
    response += servoDoorOpen ? "true" : "false";
    response += "}";
    commandProcessed = accepted;
  }
  else if (method == "ringBell") {
    if (fireActive) {
      enqueueEvent("RPC_BELL_REJECTED", false, "THINGSBOARD_RPC");
      response = rpcBaseResponse(false, method, "rejected_fire_active");
      response += "}";
    } else {
      startBellPattern(3);
      enqueueEvent("RPC_BELL", true, "THINGSBOARD_RPC");
      response = rpcBaseResponse(true, method, "bell_started");
      response += "}";
      commandProcessed = true;
    }
  }
  else if (method == "muteAlarm") {
    bool accepted = muteFireAlarmFromSource("THINGSBOARD_RPC");

    response = rpcBaseResponse(
      accepted,
      method,
      accepted ? "alarm_muted" : "alarm_not_active"
    );
    response += ",\"fire_active\":";
    response += fireActive ? "true" : "false";
    response += ",\"fire_muted\":";
    response += fireMuted ? "true" : "false";
    response += ",\"fan_pwm_effective\":";
    response += String(getEffectiveFanPWM());
    response += "}";
    commandProcessed = accepted;
  }
  else if (method == "unmuteAlarm") {
    bool wasMuted = fireMuted;
    bool alarmWasActive = fireActive;

    unmuteFireAlarmFromSource("THINGSBOARD_RPC");

    bool accepted = alarmWasActive && wasMuted;
    response = rpcBaseResponse(
      accepted,
      method,
      accepted ? "alarm_unmuted" : "alarm_not_muted"
    );
    response += ",\"fire_active\":";
    response += fireActive ? "true" : "false";
    response += ",\"fire_muted\":";
    response += fireMuted ? "true" : "false";
    response += "}";
    commandProcessed = accepted;
  }
  else if (method == "getLampBlue") {
    response = lampuBiruState == HIGH ? "true" : "false";
    commandProcessed = true;
  }
  else if (method == "getLampGreen") {
    response = lampuHijauState == HIGH ? "true" : "false";
    commandProcessed = true;
  }
  else if (method == "getLampRed") {
    response = lampuMerahState == HIGH ? "true" : "false";
    commandProcessed = true;
  }
  else if (method == "getWhitePwm") {
    // Respons harus berupa angka agar dapat langsung dibaca Knob Control.
    response = String(lampuPutihPWM);
    commandProcessed = true;
  }
  else if (method == "getFanPwm") {
    // Mengembalikan nilai yang diminta pengguna, bukan PWM efektif saat kebakaran.
    response = String(kipasPWM);
    commandProcessed = true;
  }
  else if (method == "getStatus") {
    response = rpcBaseResponse(true, method, "status");
    response += ",\"temperature\":";
    response += isnan(temp) ? "null" : String(temp, 1);
    response += ",\"humidity\":";
    response += isnan(humi) ? "null" : String(humi, 1);
    response += ",\"gas_detected\":";
    response += isGasDetected() ? "true" : "false";
    response += ",\"door_open\":";
    response += isDoorOpen() ? "true" : "false";
    response += ",\"fire_active\":";
    response += fireActive ? "true" : "false";
    response += ",\"fire_muted\":";
    response += fireMuted ? "true" : "false";
    response += ",\"fan_pwm_requested\":";
    response += String(kipasPWM);
    response += ",\"fan_pwm_effective\":";
    response += String(getEffectiveFanPWM());
    response += ",\"servo_angle\":";
    response += String(servoCommand);
    response += ",\"servo_door_open\":";
    response += servoDoorOpen ? "true" : "false";
    response += ",\"buffer_count\":";
    response += String(eventCount);
    response += ",\"persistent_buffer_count\":";
    response += String(persistentStoredCount);
    response += ",\"persistent_buffer_restored\":";
    response += persistentBufferRestored ? "true" : "false";
    response += ",\"persistent_storage_ok\":";
    response += persistentStorageOk ? "true" : "false";
    response += ",\"auth_status\":\"";
    response += lastAuthStatus;
    response += "\"";
    response += ",\"auth_failed_count\":";
    response += String(authFailedCount);
    response += ",\"security_locked\":";
    response += securityLocked ? "true" : "false";
    response += ",\"last_auth_source\":\"";
    response += lastAuthSource;
    response += "\"";
    response += "}";
    commandProcessed = true;
  }
  else {
    response = rpcBaseResponse(false, method, "unknown_method");
    response += "}";
  }

  publishRpcResponse(requestId, response);

  // Telemetry terbaru dipublikasikan pada iterasi loop berikutnya,
  // bukan langsung dari callback, agar callback MQTT tetap singkat.
  immediateTelemetryRequested = true;

