Oni44/esp32-smart-home-fire-alarm-wokwi/src/main.cpp
  Serial.print("RPC diproses: ");
  Serial.println(commandProcessed ? "YA" : "TIDAK / DITOLAK");
  Serial.println("================================");
}

void publishImmediateTelemetryIfRequested() {
  if (!immediateTelemetryRequested) return;

  if (publishTelemetry()) {
    immediateTelemetryRequested = false;
    lastTelemetryMillis = millis();
  }
}

void publishPeriodicTelemetry() {
  if (millis() - lastTelemetryMillis < TELEMETRY_INTERVAL_MS) {
    return;
  }

  lastTelemetryMillis = millis();

  if (!publishTelemetry()) {
    Serial.println("Telemetry belum dikirim: ThingsBoard tidak terhubung.");
  }
}

// Saat WiFi pertama kali tersambung, kirim pesan siap.
// Pada koneksi berikutnya, kirim sinkronisasi status terkini.
void syncTelegramAfterReconnect() {
  bool nowConnected = (WiFi.status() == WL_CONNECTED);

  if (nowConnected && !previousWiFiConnected) {
    Serial.print("WiFi tersambung. IP: ");
    Serial.println(WiFi.localIP());

    // Koneksi pertama setelah boot tidak disebut reconnect.
    if (wifiStateInitialized) {
      enqueueEvent("WIFI_RECONNECTED", true, "SYSTEM");
    } else {
      wifiStateInitialized = true;
    }

    String msg;

    if (!initialOnlineSyncSent) {
      msg = "ESP32 Smart Home ready. Mode Telegram + ThingsBoard aktif. "
            "Ketik Help untuk command.\n\n";
      initialOnlineSyncSent = true;
    } else {
      msg = "WiFi ESP32 tersambung kembali.\n";
    }

    msg += getSensorIndicatorText();
    sendTelegram(msg);

    // Bila kebakaran masih aktif, kirim ulang notifikasi prioritas.
    if (fireActive) {
      fireNotifiedTelegram = sendTelegram(fireMessage());
      lastFireTelegramTryMillis = millis();
      fireTelegramTryCount = fireNotifiedTelegram ? 1 : 0;
    }
  }

  if (!nowConnected && previousWiFiConnected) {
    Serial.println("WiFi terputus. Alarm lokal tetap berjalan.");
    enqueueEvent("WIFI_DISCONNECTED", false, "SYSTEM");
  }

  previousWiFiConnected = nowConnected;
}

// =====================================================
// SETUP & LOOP
// =====================================================
void setup() {
  Serial.begin(115200);

  // Pulihkan antrean event offline sebelum SYSTEM_BOOT baru ditambahkan.
  initializePersistentEventStorage();

  pinMode(Magnet, INPUT_PULLUP);
  pinMode(MQ2_SENSOR, INPUT_PULLUP);
  pinMode(Lampu_biru, OUTPUT);
  pinMode(Lampu_putih, OUTPUT);
  pinMode(Lampu_merah, OUTPUT);
  pinMode(Lampu_hijau, OUTPUT);
  pinMode(Kipas_angin, OUTPUT);
  pinMode(Bell, OUTPUT);

  // Servo di-attach sekali pada setup agar loop tetap non-blocking.
  myServo.setPeriodHertz(50);
  myServo.attach(SERVO_PIN, 500, 2400);

  if (SERVO_360_CONTINUOUS) {
    writeServoRaw(SERVO_360_STOP);
  } else {
    writeServoRaw(SERVO_CLOSED_ANGLE);
  }
  servoDoorOpen = false;

  applyNormalOutputs();

  lcd.begin(16, 2);
  lcd.init();
  lcd.backlight();
  lcdPrintLine(0, "= Smart Home =");
  lcdPrintLine(1, "Telegram + TB");
  delay(500);

  dht.begin();

  tbMqttClient.setServer(TB_HOST, TB_PORT);
  tbMqttClient.setBufferSize(2048);
  tbMqttClient.setKeepAlive(45);
  tbMqttClient.setSocketTimeout(5);
  tbMqttClient.setCallback(thingsBoardRpcCallback);

  bot.setChatID(CHAT_ID);
  bot.attach(newMsg);

  read_DHT22();
  showNormalLCD("Status:Aman");

  // Tetapkan baseline sensor agar kondisi awal tidak dianggap perubahan.
  previousGasForEvent = isGasDetected();
  previousDoorForEvent = isDoorOpen();
  eventSensorStateInitialized = true;

  // Event lama dari NVS tetap berada di depan antrean. SYSTEM_BOOT baru
  // ditambahkan paling belakang dan dikirim setelah MQTT tersedia.
  enqueueEvent("SYSTEM_BOOT", true, "SYSTEM");

  previousWiFiConnected = false;
  startWiFi();
}

void loop() {
  maintainWiFi();
  syncTelegramAfterReconnect();

  // Menyelesaikan gerakan servo continuous tanpa delay.
  updateServoTimedMove();

  // PRIORITAS UTAMA: fire safety lokal
  updateFireAlarm();

  // Security timer bersifat non-blocking dan tidak mengganggu fire logic.
  updateSecurityLock();

  // Status gas dan pintu tetap dipantau saat fire alarm aktif.
  if (millis() - lastSensorCheckMillis >= FAST_SENSOR_CHECK_MS) {
    lastSensorCheckMillis = millis();
    checkSensorEvents();
    cek_MQ();
    cek_Magnet();
  }

  if (millis() - lastDhtMillis >= 2000) {
    lastDhtMillis = millis();
    read_DHT22();
  }

  if (!fireActive) {
    updateBellPattern();

    if (!fg && !fm && millis() - lastLCDMillis >= 1000) {
      lastLCDMillis = millis();
      showNormalLCD("Status:Aman");
    }
  }

  // Komunikasi eksternal dijalankan setelah proses keselamatan lokal.
  maintainThingsBoard();
  syncThingsBoardConnectionEvents();
  flushEventQueue();
  publishImmediateTelemetryIfRequested();
  publishPeriodicTelemetry();

  if (WiFi.status() == WL_CONNECTED &&
      telegramConfigured() &&
      millis() - lastTelegramTickMillis >= TELEGRAM_TICK_MS) {
    lastTelegramTickMillis = millis();
    bot.tick();
  }

  delay(2);
}
